import React, { useState } from "react";
import "./moreInfo.scss";
import { Container } from "@mui/material";
import KeyboardArrowDownIcon from "@mui/icons-material/KeyboardArrowDown";
import KeyboardArrowUpIcon from "@mui/icons-material/KeyboardArrowUp";
const MoreInfo = () => {
  const [show, setShow] = useState<boolean>(true);

  const close = (): void => {
    setShow(!show);
  };

  return (
    <div className="moreInfo">
      <Container className="moreInfo-container" maxWidth="lg">
        <h4>طاقچه چیست؟</h4>
        <p className="moreInfo-text">
          طاقچه سایت و اپلیکیشن دانلود و خرید کتاب الکترونیکی و صوتی به صورت
          قانونی است. علاوه بر قانونی بودن، مزیت دیگر طاقچه برای مطالعه‌ی
          کتاب‌های الکترونیکی استفاده از فرمت epub برای بخش قابل توجهی از
          کتاب‌هاست. این فرمت بر خلاف فرمت pdf به شما این امکان را می‌دهد که
          اندازه و نوع فونت را شخصی سازی کنید تا چشمانتان هنگام مطالعه‌ی کتاب
          آسیب نبیند. همچنین امکان به اشتراک گذاشتن بریده کتاب در طاقچه و یا
          شبکه‌های اجتماعی قابلیتی است که در نسخه‌ی epub کتاب‌های الکترونیکی
          وجود دارد. کتاب‌های صوتی در طاقچه، عموما کتاب‌هایی هستند که ناشران
          معتبر صوتی آن‌ها را تهیه می‌کنند. این کتاب‌های صوتی بر خلاف فایل‌های
          صوتی رایگان موجود در سطح اینترنت، کیفیت صدابرداری خوبی دارند و برای
          آن‌ها موسیقی پس‌زمینه استفاده شده است. شما می‌توانید در طاقچه قبل از
          تصمیم به خرید کتاب‌های صوتی
          <span className={show ? "moreInfo-closeText" : ".moreInfo-showText"}>
            قسمت نمونه را در سایت و یا اپلیکیشن گوش کنید و کیفیت آن را بررسی
            کنید. برای خرید کتاب از طاقچه چه مراحلی را باید طی کنیم؟ برای خرید
            کتاب های الکترونیکی و صوتی از طاقچه کافی است ابتدا وارد حساب کاربری
            تان شوید و سپس هر کتابی را که دوست دارید، بخرید. پس از خرید کتاب،
            وارد کتابخانه خودتان در سایت و یا نسخه‌های مختلف اپلیکیشن طاقچه شوید
            و از خواندن کتاب مورد علاقه‌تان لذت ببرید. آیا با خرید اشتراک طاقچه
            بی‌نهایت می‌توانیم هر کتابی را دریافت کنیم؟ در حال حاضر در طاقچه بیش
            از ۵۰ هزار کتاب وجود دارد. از میان این کتاب‌ها فقط ۱۸ هزار عنوان در
            طرح طاقچه بی‌نهایت وجود دارند. البته به مرور سعی می‌کنیم کتاب‌های
            جدیدتر و جذاب‌تری را به این بخش اضافه کنیم. همچنین باید اضافه کنیم
            که فعلا در طاقچه بی‌نهایت کتاب صوتی وجود ندارد. چگونه می‌توانیم در
            طاقچه به دوستانمان کتاب هدیه دهیم؟ برای این کار کافی است در سایت و
            یا نسخه‌های مختلف اپلیکیشن طاقچه آیکون جعبه هدیه را انتخاب کنید و
            عملیات پرداخت را انجام دهید. پس از اتمام فرایند خرید، صفحه‌ای به شما
            نشان داده می‌شود که در آن یک لینک وجود دارد. با ارسال این لینک برای
            دوستتان می‌توانید کتاب را به او هدیه دهید. همچنین این لینک بسته به
            اینکه اطلاعات حساب کاربریتان را تا چه حد تکمیل کرده‌باشید، برایتان
            ایمیل و پیامک هم می‌شود. دوست شما برای استفاده از هدیه‌اش لازم است
            حساب کاربری طاقچه داشته باشد و یا بسازد. پس از اینکه روی لینک کلیک
            کند، کتاب مستقیما وارد کتابخانه‌اش می‌شود. در ضمن محدودیت زمانی برای
            استفاده از لینک وجود ندارد و نیاز نیست به سرعت از لینک استفاده شود.
            آیا می‌توانیم به دوستانمان اعتبار خرید هدیه دهیم؟ در حال حاضر این
            امکان وجود ندارد. همچنین امکان هدیه دادن اشتراک طاقچه بی‌نهایت هم در
            حال حاضر وجود ندارد. اما اگر به عنوان نماینده‌ای از یک جمع کتابخوان
            و یا یک سازمان می‌خواهید اعتبار خرید کتاب و یا اشتراک طاقچه بی‌نهایت
            تهیه کنید، می‌توانید با بخش همکاری‌های طاقچه تماس بگیرید. آیا با
            خرید کتاب، فایل کتاب را هم دریافت می‌کنیم؟ به دلیل نوع قراردادی که
            با ناشر کتاب‌ها داریم، امکان در اختیار قرار دادن فایل کتاب‌ها را
            نداریم. دلیل تاکید ناشران مختلف کتاب‌های الکترونیکی و صوتی بر
            رمزنگاری فایل کتاب‌ها این است که بر خلاف سایر کشورها، در صورت انتشار
            گسترده فایل کتاب‌ها به صورت غیر قانونی، امکانِ مقابله با فرد متخلف
            وجود ندارد. با تغییر قوانین کپی‌رایت و اعلام رضایت ناشران، طاقچه
            فایل کتاب‌ها را در اختیار خریداران کتاب می‌گذارد.
          </span>
        </p>
        <button className="moreInfo-btn" onClick={close}>
          {show ? <KeyboardArrowDownIcon /> : <KeyboardArrowUpIcon />}
        </button>
      </Container>
    </div>
  );
};

export default MoreInfo;
